EmployeeClientAppMC/web_messages.svclog

<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-04-06T19:20:12.5195637Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{e66c3594-7e2e-4c0f-9dfb-57990d5bbc43}" /><Execution ProcessName="iisexpress" ProcessID="22468" ThreadID="6" /><Channel/><Computer>ANAND</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-04-07T00:50:12.5165625+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8083/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo0QG8RvfwYpPhJFrj1muKX4AAAAA+iqa0KRBOk2ePyXtvMoKDqa9awtNYOZMteWbbJn/sdgACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="5d578919-6be4-482c-a0b2-c23e9340d5af" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><GetEmployee xmlns="http://tempuri.org/"><Id>1</Id></GetEmployee></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-04-06T19:20:13.0152450Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{e66c3594-7e2e-4c0f-9dfb-57990d5bbc43}" /><Execution ProcessName="iisexpress" ProcessID="22468" ThreadID="6" /><Channel/><Computer>ANAND</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-04-07T00:50:13.0142453+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>534</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Mon, 06 Apr 2020 19:20:13 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><GetEmployeeResponse xmlns="http://tempuri.org/"><GetEmployeeResult i:type="a:FullTimeEmployee" xmlns:a="http://schemas.datacontract.org/2004/07/EmployeeServiceMC" xmlns:i="http://www.w3.org/2001/XMLSchema-instance"><a:Id>1</a:Id><a:Name>Anand</a:Name><a:Gender>male</a:Gender><a:DateOfBirth>1994-09-12T00:00:00</a:DateOfBirth><a:Type>FullTimeEmployee</a:Type><a:AnnualSalary>76676</a:AnnualSalary></GetEmployeeResult></GetEmployeeResponse></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-04-06T19:20:24.2344208Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{8d092af3-67ac-4fb7-9a2e-ceaca2a81529}" /><Execution ProcessName="iisexpress" ProcessID="22468" ThreadID="6" /><Channel/><Computer>ANAND</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-04-07T00:50:24.2344208+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="ht<E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-04-08T14:23:20.6606793Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{0bf0810a-2519-42c9-8ac5-34e5ed83c6c4}" /><Execution ProcessName="iisexpress" ProcessID="20260" ThreadID="6" /><Channel/><Computer>ANAND</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-04-08T19:53:20.6586615+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8083/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo/kJ7sTsQshGtB5yfsw2x38AAAAA1TTaeYOtukeHkWAf2vPQfBrUZ/dO6YhFkcnSICDJCDQACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><h:LicenseKey xmlns:h="http://MyCompany.com/Employee">XYZ120FABC</h:LicenseKey><ActivityId CorrelationId="bfe81e85-954b-443d-9166-183d2d9f7a35" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><EmployeeRequestObject xmlns="http://MyCompany.com/Employee"><EmployeeId>1</EmployeeId></EmployeeRequestObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-04-08T14:23:21.4871873Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{0bf0810a-2519-42c9-8ac5-34e5ed83c6c4}" /><Execution ProcessName="iisexpress" ProcessID="20260" ThreadID="6" /><Channel/><Computer>ANAND</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-04-08T19:53:21.4861878+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>367</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Wed, 08 Apr 2020 14:23:21 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><EmployeeInfoObject xmlns="http://MyCompany.com/Employee"><ID>1</ID><Name>Anand</Name><Gender>male</Gender><DOB>1994-09-12T00:00:00</DOB><Type>FullTimeEmployee</Type><AnnualSalary>76676</AnnualSalary><HourlyPay>0</HourlyPay><HoursWorked>0</HoursWorked></EmployeeInfoObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-04-08T14:23:29.3826699Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{e06426f1-16f3-4b58-a3b6-5bc65dcfcced}" /><Execution ProcessName="iisexpress" ProcessID="20260" ThreadID="6" /><Channel/><Computer>ANAND</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-04-08T19:53:29.3826699+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/GetEmployee</Action><To>http://localhost:8083/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo/oJ7sTsQshGtB5yfsw2x38AAAAA1TTaeYOtukeHkWAf2vPQfBrUZ/dO6YhFkcnSICDJCDQACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><h:LicenseKey xmlns:h="http://MyCompany.com/Employee">XYZ120FABC</h:LicenseKey><ActivityId CorrelationId="b964ec49-29a3-4ce3-84c4-dd7747b81da2" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><EmployeeRequestObject xmlns="http://MyCompany.com/Employee"><EmployeeId>7</EmployeeId></EmployeeRequestObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-04-08T14:23:29.5305874Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{e06426f1-16f3-4b58-a3b6-5bc65dcfcced}" /><Execution ProcessName="iisexpress" ProcessID="20260" ThreadID="6" /><Channel/><Computer>ANAND</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-04-08T19:53:29.5296062+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>InternalServerError</StatusCode><StatusDescription>Internal Server Error</StatusDescription><WebHeaders><Content-Length>730</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Wed, 08 Apr 2020 14:23:29 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body><s:Fault><faultcode xmlns:a="http://schemas.microsoft.com/net/2005/12/windowscommunicationfoundation/dispatcher" xmlns="">a:InternalServiceFault</faultcode><faultstring xml:lang="en-IN" xmlns="">The server was unable to process the request due to an internal error.  For more information about the error, either turn on IncludeExceptionDetailInFaults (either from ServiceBehaviorAttribute or from the &lt;serviceDebug&gt; configuration behavior) on the server in order to send the exception information back to the client, or turn on tracing as per the Microsoft .NET Framework SDK documentation and inspect the server trace logs.</faultstring></s:Fault></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-04-08T14:23:45.3705257Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{3eaf524b-1d02-489c-9f51-6cd95759fecd}" /><Execution ProcessName="iisexpress" ProcessID="20260" ThreadID="6" /><Channel/><Computer>ANAND</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-04-08T19:53:45.3705257+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/SaveEmployee</Action><To>http://localhost:8083/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo/sJ7sTsQshGtB5yfsw2x38AAAAA1TTaeYOtukeHkWAf2vPQfBrUZ/dO6YhFkcnSICDJCDQACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="39265a73-14dc-4267-880d-c650aa1f52fa" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><EmployeeInfoObject xmlns="http://MyCompany.com/Employee"><ID>7</ID><Name>Anand</Name><Gender>male</Gender><DOB>1994-09-12T00:00:00</DOB><Type>FullTimeEmployee</Type><AnnualSalary>76676</AnnualSalary><HourlyPay>0</HourlyPay><HoursWorked>0</HoursWorked></EmployeeInfoObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-04-08T14:23:45.5894022Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{3eaf524b-1d02-489c-9f51-6cd95759fecd}" /><Execution ProcessName="iisexpress" ProcessID="20260" ThreadID="6" /><Channel/><Computer>ANAND</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-04-08T19:53:45.5894022+05:30" Source="TransportReceive" Type="System.ServiceModel.Channels.BufferedMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><HttpResponse><StatusCode>OK</StatusCode><StatusDescription>OK</StatusDescription><WebHeaders><Content-Length>86</Content-Length><Content-Type>text/xml; charset=utf-8</Content-Type><Date>Wed, 08 Apr 2020 14:23:45 GMT</Date><Server>Microsoft-HTTPAPI/2.0</Server></WebHeaders></HttpResponse><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header></s:Header><s:Body></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-04-08T14:23:51.6239507Z" /><Source Name="System.ServiceModel.MessageLogging" /><Correlation ActivityID="{55b07c11-536e-4e32-b71e-7b319c15bbda}" /><Execution ProcessName="iisexpress" ProcessID="20260" ThreadID="7" /><Channel/><Computer>ANAND</Computer></System><ApplicationData><TraceData><DataItem><MessageLogTraceRecord Time="2020-04-08T19:53:51.6229522+05:30" Source="TransportSend" Type="System.ServiceModel.Dispatcher.OperationFormatter+OperationFormatterMessage" xmlns="http://schemas.microsoft.com/2004/06/ServiceModel/Management/MessageTrace"><Addressing><Action>http://tempuri.org/IEmployeeService/SaveEmployee</Action><To>http://localhost:8083/EmployeeService</To></Addressing><HttpRequest><Method>POST</Method><QueryString></QueryString><WebHeaders><VsDebuggerCausalityData>uIDPo/wJ7sTsQshGtB5yfsw2x38AAAAA1TTaeYOtukeHkWAf2vPQfBrUZ/dO6YhFkcnSICDJCDQACQAA</VsDebuggerCausalityData></WebHeaders></HttpRequest><s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Header><ActivityId CorrelationId="4172e019-7a4a-4010-9983-45d9f0ef723d" xmlns="http://schemas.microsoft.com/2004/09/ServiceModel/Diagnostics">00000000-0000-0000-0000-000000000000</ActivityId></s:Header><s:Body><EmployeeInfoObject xmlns="http://MyCompany.com/Employee"><ID>17</ID><Name>Anand</Name><Gender>male</Gender><DOB>1994-09-12T00:00:00</DOB><Type>FullTimeEmployee</Type><AnnualSalary>76676</AnnualSalary><HourlyPay>0</HourlyPay><HoursWorked>0</HoursWorked></EmployeeInfoObject></s:Body></s:Envelope></MessageLogTraceRecord></DataItem></TraceData></ApplicationData></E2ETraceEvent><E2ETraceEvent xmlns="http://schemas.microsoft.com/2004/06/E2ETraceEvent"><System xmlns="http://schemas.microsoft.com/2004/06/windows/eventlog/system"><EventID>0</EventID><Type>3</Type><SubType Name="Information">0</SubType><Level>8</Level><TimeCreated SystemTime="2020-04-08T14:23:51.6249500Z" /><S